---
title: ImageView
classe: Autodesk.Revit.DB.ImageView
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.ViewDrafting
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 2
---

# ImageView

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `ElementId ImageInstanceId { get; }` | `imageView.ImageInstanceId` | ElementId |
| `ImageView Create(Document, ImageTypeOptions)` | `ImageView.Create(document, options)` | ImageView |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```